Extensions/src/Documents/АктВыполненныхРабот/АктВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>АктВыполненныхРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

Extensions/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КурсыВалют</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/Enums/ТипыРасчетов/ТипыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Аванс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Долг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Documents/АктВыполненныхРабот/ManagerModule.bsl
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	// Щербаков +++
	ТЗРаботыУслуги = ДокументСсылкаАктВыполненныхРабот.РаботыИУслуги.Выгрузить();
	ТЗРаботыУслуги.Колонки.Добавить("СуммаРегл"	, Новый ОписаниеТипов("Число"));
	ТЗРаботыУслуги.Колонки.Добавить("СуммаНДСРегл", Новый ОписаниеТипов("Число"));
	
	Для Каждого Строк Из ТЗРаботыУслуги Цикл 
		Строк.СуммаРегл = Строк.Сумма * ДокументСсылкаАктВыполненныхРабот.Курс * ДокументСсылкаАктВыполненныхРабот.Кратность;
		Строк.СуммаНДСРегл = Строк.СуммаНДС * ДокументСсылкаАктВыполненныхРабот.Курс * ДокументСсылкаАктВыполненныхРабот.Кратность;
	КонецЦикла;	
	// +++ { AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
	Если ДокументСсылкаАктВыполненныхРабот.ВалютаДокумента <> Константы.ВалютаУчета.Получить()
		И ДокументСсылкаАктВыполненныхРабот.Предоплата.Количество() > 0 
		И Не ДокументСсылкаАктВыполненныхРабот.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
		Тогда
	// +++ } AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
		
		РегламентированныйУчетСервер.ПересчитатьСуммыВалютыПредоплатыВСуммыРеглУчета(ТЗРаботыУслуги, ДокументСсылкаАктВыполненныхРабот);
		
	КонецЕсли;
	
	ТЗРаботыУслуги.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.АктВыполненныхРабот"));
	//ТЗВнеоборотныеАктивы.Колонки.Добавить("СчетЗатратРегл", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));     
	//ТЗВнеоборотныеАктивы.Колонки.Добавить("СчетДоходаРегл", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТЗРаботыУслуги.ЗаполнитьЗначения(ДокументСсылкаАктВыполненныхРабот, "Ссылка");
	//ТЗВнеоборотныеАктивы.ЗаполнитьЗначения(ДокументСсылкаПередачаВА.СчетЗатратРегл	, "СчетЗатратРегл");
	//ТЗВнеоборотныеАктивы.ЗаполнитьЗначения(ДокументСсылкаПередачаВА.СчетДоходаРегл	, "СчетДоходаРегл");
	
	Запрос.УстановитьПараметр("ТЗРаботыУслуги", ТЗРаботыУслуги);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка,
	|	АктВыполненныхРаботРаботыИУслуги.НомерСтроки,
	|	АктВыполненныхРаботРаботыИУслуги.Номенклатура,
	|	АктВыполненныхРаботРаботыИУслуги.Характеристика,
	|	АктВыполненныхРаботРаботыИУслуги.Количество,
	|	АктВыполненныхРаботРаботыИУслуги.ЕдиницаИзмерения,
	|	АктВыполненныхРаботРаботыИУслуги.Цена,
	|	АктВыполненныхРаботРаботыИУслуги.ПроцентСкидкиНаценки,
	|	АктВыполненныхРаботРаботыИУслуги.Сумма,
	|	АктВыполненныхРаботРаботыИУслуги.СтавкаНДС,
	|	АктВыполненныхРаботРаботыИУслуги.СуммаНДС,
	|	АктВыполненныхРаботРаботыИУслуги.Всего,
	|	АктВыполненныхРаботРаботыИУслуги.ЗаказПокупателя,
	|	АктВыполненныхРаботРаботыИУслуги.Содержание,
	|	АктВыполненныхРаботРаботыИУслуги.ПроцентАвтоматическойСкидки,
	|	АктВыполненныхРаботРаботыИУслуги.СуммаАвтоматическойСкидки,
	|	АктВыполненныхРаботРаботыИУслуги.КлючСвязи,
	|	АктВыполненныхРаботРаботыИУслуги.СуммаНДСРегл,
	|	АктВыполненныхРаботРаботыИУслуги.СуммаРегл
	|ПОМЕСТИТЬ Вт_РаботыИУслуги
	|ИЗ
	|	&ТЗРаботыУслуги КАК АктВыполненныхРаботРаботыИУслуги";
	
	Запрос.Выполнить();
	// Щербаков ---
	
	#Область ТекстЗапросаИнициализироватьДанныеДокумента
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА АктВыполненныхРабот.Договор.ЭтоДоговорОбслуживания
	|				И АктВыполненныхРабот.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	АктВыполненныхРабот.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	АктВыполненныхРабот.Договор.ВалютаРасчетов КАК ДоговорВалютаРасчетов,
	|	АктВыполненныхРабот.Договор.РасчетыВУсловныхЕдиницах КАК ДоговорРасчетыВУсловныхЕдиницах,
	|	АктВыполненныхРабот.Контрагент,
	|	АктВыполненныхРабот.ВалютаДокумента,
	|	АктВыполненныхРабот.Кратность,
	|	АктВыполненныхРабот.Курс,
	|	АктВыполненныхРабот.Договор,
	|	АктВыполненныхРабот.Дата
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|ГДЕ
	|	АктВыполненныхРабот.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|			&МоментВремени,
	|			Валюта В (&ВалютаУчета, &ВалютаНациональная, &ВалютаНакладной)
	|				ИЛИ Валюта В
	|					(ВЫБРАТЬ
	|						ВременнаяТаблицаШапка.ДоговорВалютаРасчетов
	|					ИЗ
	|						ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктВыполненныхРаботРаботыИУслуги.НомерСтроки КАК НомерСтроки,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Подразделение КАК СтруктурнаяЕдиница,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Ответственный КАК Ответственный,
	|	АктВыполненныхРаботРаботыИУслуги.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
	|	АктВыполненныхРаботРаботыИУслуги.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА АктВыполненныхРаботРаботыИУслуги.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	АктВыполненныхРаботРаботыИУслуги.ЗаказПокупателя КАК ЗаказПокупателя,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка КАК Документ,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Контрагент КАК Контрагент,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Договор КАК Договор,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Подразделение КАК ПодразделениеПродажи,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности
	|		ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.Номенклатура.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажи,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|		ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|	КОНЕЦ КАК СчетУчетаПродажи,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|		ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|	КОНЕЦ КАК СчетУчетаСебестоимость,
	|	АктВыполненныхРаботРаботыИУслуги.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(АктВыполненныхРаботРаботыИУслуги.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА АктВыполненныхРаботРаботыИУслуги.Количество
	|		ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.Количество * АктВыполненныхРаботРаботыИУслуги.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	АктВыполненныхРаботРаботыИУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АктВыполненныхРаботРаботыИУслуги.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА АктВыполненныхРаботРаботыИУслуги.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.СуммаРегл
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АктВыполненныхРаботРаботыИУслуги.Ссылка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА АктВыполненныхРаботРаботыИУслуги.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|						ТОГДА АктВыполненныхРаботРаботыИУслуги.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.СуммаНДСРегл
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АктВыполненныхРаботРаботыИУслуги.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА АктВыполненныхРаботРаботыИУслуги.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.СуммаНДСРегл
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСПродажи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АктВыполненныхРаботРаботыИУслуги.Ссылка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА АктВыполненныхРаботРаботыИУслуги.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|						ТОГДА АктВыполненныхРаботРаботыИУслуги.СуммаНДС * КурсыРегВалюты.Курс * АктВыполненныхРаботРаботыИУслуги.Ссылка.Кратность / (АктВыполненныхРаботРаботыИУслуги.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|					ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.СуммаНДС
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АктВыполненныхРаботРаботыИУслуги.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА АктВыполненныхРаботРаботыИУслуги.Всего * КурсыРегВалюты.Курс * АктВыполненныхРаботРаботыИУслуги.Ссылка.Кратность / (АктВыполненныхРаботРаботыИУслуги.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	АктВыполненныхРаботРаботыИУслуги.КлючСвязи,
	|	АктВыполненныхРаботРаботыИУслуги.Всего КАК ВсегоВалютаДокумента,
	|	АктВыполненныхРаботРаботыИУслуги.СуммаНДС КАК СуммаНДСВалютаДокумента,
	|	АктВыполненныхРаботРаботыИУслуги.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаРегл,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|		ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|	КОНЕЦ КАК СчетУчетаПродажиРегл,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		ИНАЧЕ АктВыполненныхРаботРаботыИУслуги.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|	КОНЕЦ КАК СчетУчетаСебестоимостьРегл,
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Организация.ВидНалогаНДС КАК ВидНалогаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаРаботыИУслуги
	|ИЗ
	|	Вт_РаботыИУслуги КАК АктВыполненныхРаботРаботыИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаНациональнаяВалюта.Значение
	|					ИЗ
	|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|		ПО (ИСТИНА),
	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Договор КАК Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельностиПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетовКуда,
	|	&Ссылка КАК ДокументКуда,
	|	ТаблицаДокумента.Ссылка.ДокументОснование КАК ДокументОснование,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|		ИНАЧЕ ТаблицаДокумента.Документ.Статья
	|	КОНЕЦ КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Дата
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ КАК ДокументДата,
	// Щербаков +++
	//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	// +++ { AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
	//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Ссылка.Кратность) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ) КАК Сумма,
	// +++ } AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	// Щербаков ---
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЭквайринговаяОперация,
	|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ) КАК ДатаПлатежа,
	|	ТаблицаДокумента.Курс,
	|	ТаблицаДокумента.Кратность,
	|	ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	// +++ { AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
	//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс / ТаблицаДокумента.Кратность КАК ЧИСЛО(15, 2))) КАК СуммаРубПоКурсуАванса
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
	|				ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Ссылка.Курс / ТаблицаДокумента.Ссылка.Кратность КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс / ТаблицаДокумента.Кратность КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) КАК СуммаРубПоКурсуАванса	
	// +++ } AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
	|ПОМЕСТИТЬ ВременнаяТаблицаПредоплата
	|ИЗ
	|	Документ.АктВыполненныхРабот.Предоплата КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаНакладной) КАК КурсыВалютДокументаСрезПоследних
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	// Щербаков +++
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл,
	// Щербаков ---
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|		ИНАЧЕ ТаблицаДокумента.Документ.Статья
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Дата
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.ДокументОснование,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал,
	|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Курс,
	|	ТаблицаДокумента.Кратность,
	|	ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктВыполненныхРаботСкидкиНаценки.КлючСвязи,
	|	АктВыполненныхРаботСкидкиНаценки.СкидкаНаценка,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АктВыполненныхРаботСкидкиНаценки.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА АктВыполненныхРаботСкидкиНаценки.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ АктВыполненныхРаботСкидкиНаценки.Сумма * АктВыполненныхРаботСкидкиНаценки.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * АктВыполненныхРаботСкидкиНаценки.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	АктВыполненныхРаботСкидкиНаценки.Ссылка.Дата КАК Период,
	|	АктВыполненныхРаботСкидкиНаценки.Ссылка.Подразделение КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВременнаяТаблицаАвтоСкидкиНаценки
	|ИЗ
	|	Документ.АктВыполненныхРабот.СкидкиНаценки КАК АктВыполненныхРаботСкидкиНаценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаНациональнаяВалюта.Значение
	|					ИЗ
	|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|		ПО (ИСТИНА),
	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
	|ГДЕ
	|	АктВыполненныхРаботСкидкиНаценки.Ссылка = &Ссылка
	|	И АктВыполненныхРаботСкидкиНаценки.Сумма <> 0";
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктВыполненныхРабот);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ВалютаНакладной", ДокументСсылкаАктВыполненныхРабот.ВалютаДокумента);
	
	Запрос.ВыполнитьПакет();
	
	// Формирование проводок документа.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаВыпускПродукции(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПродажи(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗаказыПокупателей(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасы(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаУправленческий(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_АктВыполненныхРабот(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	// Щербакво ---
	
	// ДисконтныеКарты
	СформироватьТаблицаПродажиПоДисконтнойКарте(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	// АвтоматическиеСкидки
	СформироватьТаблицаПродажиПоПредоставленнымАвтоматическимСкидкам(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	// Эквайринг
	ЭквайринговыеОперацииСервер.СформироватьТаблицаДоходыИРасходыКассовыйМетодЭквайринг(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
	
	// Рублевые суммы документов
	Если ДокументСсылкаАктВыполненныхРабот.Договор.ВалютаРасчетов <> Константы.НациональнаяВалюта.Получить() Тогда
		
		ТаблицаВзаиморасчеты = РублевыеСуммыДокументов.ПодготовитьТаблицуДокументаРасчетыВВалюте(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства, "ВременнаяТаблицаРаботыИУслуги");
		
		Если СтруктураДополнительныеСвойства.ДляПроведения.ВалютаДокумента <> СтруктураДополнительныеСвойства.ДляПроведения.НациональнаяВалюта Тогда
			РублевыеСуммыДокументов.РаспределитьАвансыПоТаблицеРеализации(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства, ТаблицаВзаиморасчеты, "РаботыИУслуги");
		КонецЕсли;
		РублевыеСуммыДокументов.СформироватьТаблицаРублевыеСуммыДокументовВВалюте(ДокументСсылкаАктВыполненныхРабот, СтруктураДополнительныеСвойства);
		РублевыеСуммыДокументов.ДобавитьДвиженияВТаблицуРасчетов(
			ТаблицаВзаиморасчеты,
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателями,
			ДокументСсылкаАктВыполненныхРабот,
			СтруктураДополнительныеСвойства,
			Ложь);
			
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРублевыеСуммыДокументовВВалюте", Новый ТаблицаЗначений);
	КонецЕсли;
	
КонецПроцедуры
